{
    "_comment": "Item Groups",
    "itemGroup.boundtotems": "Bound Totems",

    "_comment": "Tooltips",
    "tooltip.boundtotems.entity.name": "§4Bound Entity:§7 %s",
    "tooltip.boundtotems.entity.uuid": "§4UUID:§7 %s",
    "tooltip.boundtotems.location": "§2Location:§7 %s [%s, %s, %s]",

    "_comment": "Items",
    "item.boundtotems.bound_totem": "Bound",
    "item.boundtotems.bound_totem_teleporting": "Bound Teleporting",
    "item.boundtotems.ritual_dagger.base": "Ritual Dagger",
    "item.boundtotems.ritual_dagger.bloody": "Bloody Ritual Dagger",
    "item.boundtotems.ritual_dagger.bound": "Bound Ritual Dagger",
    "item.boundtotems.carving_knife": "Carving Knife",
    "item.boundtotems.plank": "Plank",
    "item.boundtotems.bound_compass": "Bound Compass",

    "_comment": "Blocks",
    "block.boundtotems.totem_shelf": "Totem Shelf",

    "_comment": "Chat",
    "chat.boundtotems.teleport.failed": "Bound teleporting totem dimension change failed.",

    "_comment": "Commands",
    "command.boundtotems.shelf.locate.entity": "Only living entities can send this command.",
    "command.boundtotems.shelf.locate.none": "There are no totem shelves bound to you in this dimension.",

    "_comment": "Configs - Client",
    "config.boundtotems.client": "Client",
    "config.boundtotems.client.tooltip": "Contains configs only accessed by the client",
    "config.boundtotems.client.animation.disable": "Disable Totem Animation",
    "config.boundtotems.client.animation.disable.tooltip": "Setting this to true will prevent the displaying of the large floating totem animation that takes up the screen upon being saved from death by a non-held inventory totem of undying.",

    "_comment": "Configs - Server",
    "config.boundtotems.server": "Server",
    "config.boundtotems.server.tooltip": "Contains configs only accessed by the server",
    "config.boundtotems.server.search": "Inventory Search Location",
    "config.boundtotems.server.search.tooltip": "1) If set to WHOLE_INVENTORY, the entire inventory will be searched for totems; 2) If set to HOTBAR_ONLY, only the hotbar of the inventory will be searched for totems; 3) If set to HELD_ONLY, only totems that the player is holding will save them from death.",
    "config.boundtotems.server.prevent.death.all": "Prevent All Death",
    "config.boundtotems.server.prevent.death.all.tooltip": "If set to true, non-held inventory totems of undying can save the player from death even from damage sources that harm players in creative mode (such as void damage and /kill command damage).",
    "config.boundtotems.server.effects.clear": "Clear Potion Effects",
    "config.boundtotems.server.effects.clear.tooltip": "If set to true, all pre-existing potion effects will be cleared from the player upon being saved from death by a non-held inventory totem of undying.",
    "config.boundtotems.server.effects.apply": "Apply Potion Effects",
    "config.boundtotems.server.effects.apply.tooltip": "These potion effects will be applied to the player upon being saved from death by a non-held inventory totem of undying. Each string specifies a potion effect in exactly the same way the /effect command does (e.i. the required first argument specifies a potion by id or by modId:name, and the second/third optional arguments are duration in seconds and amplification). These effects will be applied whether or not pre-existing effects were previously cleared.",
    "config.boundtotems.server.broadcast": "Broadcast Particles & Sound",
    "config.boundtotems.server.broadcast.tooltip": "If set to true, totem particles and sound will broadcast to all nearby players upon being saved from death by a non-held inventory totem of undying.",
    "config.boundtotems.server.result.particles": "Spawn Particles",
    "config.boundtotems.server.result.particles.tooltip": "If set to true, totem particles will spawn for all nearby players upon being saved from death by a non-held inventory totem of undying.",
    "config.boundtotems.server.result.sound": "Play Sound",
    "config.boundtotems.server.result.sound.tooltip": "If set to true, totem sound will play for all nearby players upon being saved from death by a non-held inventory totem of undying.",
    "config.boundtotems.server.result.animation": "Play Animation",
    "config.boundtotems.server.result.animation.tooltip": "If set to true, the large floating totem animation will that takes up the screen will play upon upon being saved from death by a non-held inventory totem of undying.",
    "config.boundtotems.server.health.percentage": "Set Health To Percentage Of Max",
    "config.boundtotems.server.health.percentage.tooltip": "If set to true, 'New Health Value' will specify the percent of the player's max heath to set the new health value to upon being saved from death by a non-held inventory totem of undying. If set to false, it will specify the number of hearts (1 = 1/2 heart) to set the new health value to.",
    "config.boundtotems.server.health.value": "New Health Value",
    "config.boundtotems.server.health.value.tooltip": "Specifies the value (either percentage of max health, or absolute value (1 = 1/2 heart), depending on what 'Set Health To Percentage Of Max' is set to) that the players heath will be set to upon being saved from death by a non-held inventory totem of undying.",
    "config.boundtotems.server.shelf.distance": "Max Distance To Shelf",
    "config.boundtotems.server.shelf.distance.tooltip": "Specifies the maximum distance in meters from a totem shelf an entity must be when binding that shelf to that entity for the binding to be successful.",
    "config.boundtotems.server.shelf.max": "Max Bound Shelves",
    "config.boundtotems.server.shelf.max.tooltip": "Specifies the maximum number of shelves that can be bound to an entity at a time. If an additional shelf is bound once the max has been reached, a randomly selected currently bound shelf will be struck with lightning and converted into a useless charred shelf. Items can be taken from a charred shelf but cannot be placed in it, and any totems it will have no effect as long as they remain in it.",
    "config.boundtotems.server.compass.sync": "Bound Compass Sync Interval",
    "config.boundtotems.server.compass.sync.tooltip": "Specifies the time in seconds between syncing of the client's bound shelf positions to the server while holding a bound compass.",

    "_comment": "Potion Effects",
    "potion_effect.boundtotems.error": "The config-specified potion effect string '%s' contains the following error: %s",
    "potion_effect.boundtotems.not_found": "There is no such potion effect with registry name %s",
    "potion_effect.boundtotems.num.invalid": "'%s' is not a valid number",
    "potion_effect.boundtotems.num.too_small": "The number you have entered (%s) is too small, it must be at least %s",
    "potion_effect.boundtotems.num.too_big": "The number you have entered (%s) is too big, it must be at most %s",

    "_comment": "JEI",
    "jei.boundtotems.in_world_crafting.entity_name": "<name>",
    "jei.boundtotems.in_world_crafting.category": "In-World Crafting",
    "jei.boundtotems.in_world_crafting.category.tool": "Tool",
    "jei.boundtotems.in_world_crafting.recipe.totem_shelf_frame": "Strip two oak logs by right clicking them, then hold the left mouse button to gradually carve them into a totem shelf frame. Stop carving once four planks have been dropped.",
    "jei.boundtotems.in_world_crafting.recipe.totem_shelf": "Right click the totem shelf frame with each of the four planks to complete construction of the shelf. The shelf can now be broken and picked up as an item, if you wish to reposition or store it.",
    "jei.boundtotems.in_world_crafting.recipe.bloody_dagger": "Attack a living entity with a clean ritual dagger to cover it in that entity's blood. Right click with a dagger while sneaking to cover it in your own blood. Bloody daggers can be cleaned in cauldrons for reuse, if desired.",
    "jei.boundtotems.in_world_crafting.recipe.bind_totem": "Throw a totem of undying on the ground, then right click it with a bound or bloody ritual dagger to bind that totem to the entity whose blood the dagger is covered in.",
    "jei.boundtotems.in_world_crafting.recipe.bind_compass": "Throw a compass on the ground, then right click it with a bound or bloody ritual dagger to bind that compass to the entity whose blood the dagger is covered in.",
    "jei.boundtotems.in_world_crafting.recipe.bind_shelf": "Stick a bound or bloody ritual dagger into the front of a totem shelf by right clicking it. The shelf will heat up and when lightning strikes it, if the entity whose blood the dagger is covered in is less than %s meters away, the dagger and shelf will be permanently bound to that entity. Otherwise, the shelf will be destroyed by the lightning. If an additional shelf is bound once the max number of %s has been reached, a randomly selected currently bound shelf will be struck with lightning and converted into a useless charred shelf. Items can be taken from a charred shelf but cannot be placed in it, and any totems it will have no effect as long as they remain in it. Remove the dagger by right clicking it with an empty hand. The dagger can no longer be cleaned in a cauldron, and the shelf will be destroyed if it's ever broken.",
    "jei.boundtotems.in_world_crafting.recipe.shelf_put_take_totems": "Right click a totem shelf with a bound totem to put it on the shelf, and right click a totem on a shelf with an empty hand to remove it. A bound totem in any shelf bound to an entity in any dimension can be consumed and will save that entity from death.",
    "jei.boundtotems.item_info.carving_knife": "This is used to carve oak logs into planks and a totem shelf frame.",
    "jei.boundtotems.item_info.plank": "These are produced by carving knives and are attached to totem shelf frames to complete the construction of totem shelves.",
    "jei.boundtotems.item_info.ritual_dagger": "When covered in a living entity's blood by cutting it, this is used to bind totems of undying and totem shelves to that entity.",
    "jei.boundtotems.item_info.bound_compass": "This is created by cutting a compass with a ritual dagger covered in a living entity's blood. The player who is bound to the compass will see the needle pointing to the nearest totem shelf bound to them in their current dimension.",
    "jei.boundtotems.item_info.bound_totem": "This is created by cutting a totem of undying with a ritual dagger covered in a living entity's blood. When this is %s, or in a totem shelf bound to it, when it is about to die, the totem will be consumed and will save it from death.",
    "jei.boundtotems.item_info.bound_totem_teleporting": "In addition to saving a living entity from death, this will also teleport the entity to a saved location in a given dimension. Right click while sneaking to set the saved location and looking direction.",
    "jei.boundtotems.item_info.totem_shelf": "This is constructed with a carving knife and the planks that drop in the carving process, and is bound to a living entity with a ritual dagger covered in the blood of that entity. This can hold up to six totems that are bound to the entity. When it is about to die, if there are no totems %s, a totem from this shelf will be consumed and will save it from death.",
    "jei.boundtotems.item_info.whole_inventory": "anywhere in the entity's inventory",
    "jei.boundtotems.item_info.hotbar_only": "in the entity's hotbar",
    "jei.boundtotems.item_info.held_olny": "held in the entity's main hand or off hand"
}